TSD_TK/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TSD_TK/src/InformationRegisters/Штрихкоды/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает список штрихкодов указанной номенклатуры.
//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для которой необходимо получить штрихкоды
//
// Возвращаемое значение:
//   Массив из Строка - массив штрихкодов номенклатуры
Функция ШтрихкодыНоменклатуры(Номенклатура) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Штрихкоды.Штрихкод
    |ИЗ
    |   РегистрСведений.Штрихкоды КАК Штрихкоды
    |ГДЕ
    |   Штрихкоды.Номенклатура = &Номенклатура";

    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

    РезультатЗапроса = Запрос.Выполнить();

    Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод");

КонецФункции

// Преобразует весовой штрихкод в соответствии с форматом EAN13 и корректирует количество товара
//
// Параметры:
//   ТекШтрихкод - Структура:
//                 * Штрихкод - Строка - штрихкод товара
//                 * Количество - Число - количество товара
//                 * КодВесовогоТовара - Строка - код весового товара (формируется процедурой)
//                 * ПрефиксВесовогоТовара - Число - префикс весового товара (формируется процедурой)
Процедура ПреобразоватьВесовойШтрихкод(ТекШтрихкод) Экспорт

    ПрефиксыВесовыхШтрихкодов = ПрефиксыВесовыхШтрихкодов();

    Если СтрДлина(ТекШтрихкод.Штрихкод) = 13 // EAN13

        И Лев(ТекШтрихкод.Штрихкод, 1) = "2" // Внутренний штрихкод

        И ПрефиксыВесовыхШтрихкодов.Найти(Сред(ТекШтрихкод.Штрихкод, 2, 1)) <> Неопределено Тогда // Найден префикс весового товара
        
        // Штрихкод является весовым, выполняем преобразование.
        // Формат весового штрихкода: 2 + П + ЧЧЧЧЧЧ + BBBB + K
        // Где,
        //  П     - Префикс весового товара
        //  ЧЧЧЧЧЧ - код весового товара
        //  BBBB - Вес
        //  К     - Контрольное число

        ВнутреннийШтрихкод12 = Лев(ТекШтрихкод.Штрихкод, 8) + "0000";
        ВнутреннийШтрихкод13 = ВнутреннийШтрихкод12 + КонтрольныйСимволEAN(ВнутреннийШтрихкод12, 13);
        Вес = Число(Сред(ТекШтрихкод.Штрихкод, 9, 1)) + Число(Сред(ТекШтрихкод.Штрихкод, 10, 3)) / 1000;

        ТекШтрихкод.Штрихкод   = ВнутреннийШтрихкод13;
        ТекШтрихкод.Количество = ТекШтрихкод.Количество * Вес;
        ТекШтрихкод.Вставить("КодВесовогоТовара", Формат(Число(Сред(ТекШтрихкод.Штрихкод, 3, 6)), "ЧЦ=6; ЧДЦ=0; ЧГ="));
        ТекШтрихкод.Вставить("ПрефиксВесовогоТовара", Число(Сред(ТекШтрихкод.Штрихкод, 2, 1)));

    КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вычисляет контрольный символ для штрихкодов EAN по алгоритму модуля 10
//
// Параметры:
//   ШтрихКод - Строка - штрихкод без контрольной цифры
//   Тип      - Число - тип штрихкода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//   Строка - контрольный символ штрихкода (одна цифра)
//
// Пример:
//   КонтрольныйСимволEAN("4600051000057", 13) = "7"
//   КонтрольныйСимволEAN("1234567", 8) = "0"
Функция КонтрольныйСимволEAN(Знач ШтрихКод, Знач Тип)

    Четн = 0;
    Нечетн = 0;

    КоличествоИтераций = ?(Тип = 13, 6, 4);

    Для Индекс = 1 По КоличествоИтераций Цикл
        Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
        Иначе
            Четн   = Четн + Сред(ШтрихКод, 2 * Индекс, 1);
        КонецЕсли;
        Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
    КонецЦикла;

    Если Тип = 13 Тогда
        Четн = Четн * 3;
    Иначе
        Нечетн = Нечетн * 3;
    КонецЕсли;

    КонтЦифра = 10 - (Четн + Нечетн) % 10;

    Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции // КонтрольныйСимволEAN()

// Возвращает список префиксов, используемых для идентификации весовых штрихкодов
//
// Возвращаемое значение:
//   Массив из Строка - префиксы весовых штрихкодов
Функция ПрефиксыВесовыхШтрихкодов() Экспорт
    Результат = Новый Массив;

    Результат.Добавить("1");

    Возврат Результат;

КонецФункции // ПрефиксыВесовыхШтрихкодов()

#КонецОбласти
